api/artillery.yml
config:
  target: 'http://localhost:3000' 
  phases:
    - duration: 60
      arrivalRate: 100 
  variables:
    email: 'user{{ $index }}@example.com'
scenarios:
  - name: Test de charge pour l'inscription
    flow:
      - post:
          url: '/auth/register'
          json:
            email: '{{ email }}'
            password: 'ValidPassword123!'
            firstname: 'John'
            lastname: 'Doe'
          capture:
            - json: '$.id'
              as: 'userId'
          expect:
            - statusCode: 201
  - name: Test de charge pour la connexion
    flow:
      - post:
          url: '/auth/login'
          json:
            email: '{{ email }}'
            password: 'ValidPassword123!'
          capture:
            - json: '$.access_token'
              as: 'accessToken'
          expect:
            - statusCode: 201